include/SystemDatetime.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
    xmlns:env="http://www.w3.org/2003/05/soap-envelope"
    xmlns:target="http://www.onvif.org/ver10/device/wsdl">
    <env:Body>
        <target:GetSystemDateAndTime/>
    </env:Body>
</env:Envelope>
